

//         ████████     ██████
//        █░░░░░░░░██_██░░░░░░█
//       █░░░░░░░░░░░█░░░░░░░░░█
//      █░░░░░░░███░░░█░░░░░░░░░█
//      █░░░░███░░░███░█░░░████░█
//    █░░░██░░░░░░░░███░██░░░░██
//   █░░░░░░░░░░░░░░░░░█░░░░░░░░███
//   █░░░░░░░░░░░░░██████░░░░░████░░█
//   █░░░░░░░░░█████░░░████░░██░░██░░█
//  ██░░░░░░░███░░░░░░░░░░█░░░░░░░░███
// █░░░░░░░░░░░░░░█████████░░█████████
//█░░░░░░░░░░█████ ████   ████ █████ █
//█░░░░░░░░░░█      █ ███   █   ███ █ █
//█░░░░░░░░░░░░█   ████ ████    ██ ████
//░░░░░░░░░░░░░█████████░░░████████░░░█
//░░░░░░░░░░░░░░░░█░░░░░█░░░░░░░░░░░░█
//░░░░░░░░░░░░░░░░░░░░██░░░░█░░░░░░██
//░░░░░░░░░░░░░░░░░░██░░░░░░░███████
//░░░░░░░░░░░░░░░░██░░░░░░░░░░█░░░░░█                                            _____                                 _____                                            _____                                                   _____
//░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█                                          /\    \                               /\    \                                          /\    \                                                 /\    \
//░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█                      ::                 /::\    \                             /::\    \                                        /::\____\                                               /::\____\
//░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█                                        /::::\    \                           /::::\    \           :::         ::           ::: ::/    /                         :                   :: ::/    /
//░░░░░░░░░░░█████████░░░░░░░░░░░░░░██                                       /::::::\    \                         /::::::\    \                               ::: : :::/    /                                              /:::/    /
//░░░░░░░░░░█▒▒▒▒▒▒▒▒███████████████▒▒█                                     /:::/\:::\    \                    :: ::::/\:::\    \                                  /:::/    /                                              /:::/    /
//░░░░░░░░░█▒▒███████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█                                    /:::/__\:::\    \                     /:::/__\:::\    \                                /:::/    /                                            :::: :/____/
//░░░░░░░░░█▒▒▒█▓▓▓▓██████████████████                                    /::::\   \:::\    \                   /::::\   \:::\    \                              /:::/    /                                              /::::\    \
//░░░░░░░░░██▒▒█▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█                                       /::::::\   \:::\    \                 /::::::\   \:::\    \                            /:       /      _____                                   /::::::\    \   _____
//░░░░░░░░░░█▒▒█▓█████████████████ ████                                 /:::/\:::\   \:::\ ___\               /:::/\:::\   \:::\____\                          /:::/____/      /\    \                                 /:::/\:::\    \ /\    \
//░░░░░░░░░░█▒▒██▓▓▒▓▒▓▒▓▒▒▒▒▒▒▒▒▓█▓▒▒▒█                               /:::/__\:::\   \:::|    |             /:::/  \:::\   \:::|    |                         :::|    /      /::\____\                        ::::::: :::/ : :::\    /::\____\
//░░░░░░░░░█▒▒████████▓▒███▓██▒▒▒▒▒▒▒▒▒█                  :            \:::\   \:::\  /:::|____|             \::/   |::::\  /:::|____|                      : :: :|____\     /:::/    /                               \::/    \:::\: ::::/    /
//░░░░░░░░░█▒▒▒▒▒▒▒▒▒█████████████▓█▓██                                 \:::\   \:::\/:::/    /               \/____|:::::\/:::/    /                          \:::\    \   /:::/    /                                 \/____/: :::\/:::/    /
//░░░░░░░░░░████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█                                  \:::\   \::::::/    /                      |:::::::::/    /                            \:::\   :: : ::/    /                                 :  :  : : :::::::/    /
//░░░░░░░░░░░░░░░░░░██████████████████                                    \:::\   \::::/    /          :  :         |::|\::::/    /           ::                 \:::\    /:::/    /               ::::                          \::       /
//░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█            ::                           \:::\  /:::/    /                      :: ::| \::/____/                                \:::\__/:::/    /                                              /:::/    /
//██░░░░░░░░░░░░░░░░░░░░░░░░░░░██                                           \:::\/:::/    /                         |::|  ~|                                       \::::::::/    /                                             : :::/    /
//▓██░░░░░░░░░░░░░░░░░░░░░░░░██                                              \::::::/    /                          |::|   |                                        \::::::/    /                                              /:::/    /
//▓▓▓███░░░░░░░░░░░░░░░░░░░░█                                                 \::::/    /                           \::|   |                                         \::::/    /                              ::: :           /:::/    /
//▓▓▓▓▓▓███░░░░░░░░░░░░░░░██                                 :                 \::/____/            :                \:|   |               :    ::::                  \::/____/                                               \::/    /
//▓▓▓▓▓▓▓▓▓███████████████▓▓█                                                   ⠋                                     \|___|                                           ⠩                                                      \/____/
//▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓██
//▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█                                                                                                                                                                                                                                               |                                                                    |                                      |
//▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█                                                                    |                                                                                                             |
//______________________________                                                                                                                       |                                                                                                                      |                                                                                                                                              |                    |
//___________________________
//_ ______ _____ _________
///            /                                                         |                                |                       |                    |                |                       |                    |                |                       |                    |                     |                       |                    |
//               
//       \                          |                                |                                               |  |                                          |                    |                                          |                       |                    |  |                                           |                    |        |                    |                              |
//               //
//     |               |                                 |
//               
//                 |                                                |            |                                   |                               |                           |                               |                           |                               |                                |                               |
//          |                                  |                                     |
//               
//                 |                     |                                                     |                                   |                               |     |                                   |                               |     |                                   |                               |          |                                   |                               |
//  |                          |                       |                    |
//          |                                    |                                         |     |                    |                                    | |     |                    |                                    | |     |                    |                                    |      |     |                                                        |
//     |                        |                                 |      |                                |                       |                    |                |                       |                    |                |                       |                    |                     |                       |                    |
//               
//                     |                                                |      |                                   |                               |                         |                               |                         |                               |                              |                               |
//          |                                   |                               |                   |                                |                       |                    |          |                                |                       |                    |          |                                |                       |                    |               |                                |                                        |
//               
//                 |                     |
//  |                                |                       |                    |            |                                |                       |                    |     |                                |                       |                    |     |                                |                       |                              |                                |
//          |                               |                                         |                              |                       |                    |                           |                       |                    |                           |                       |                    |                                |                       |                    |
//               
//  |         |                                   PRESENTATION                                                |                                |                    |   |                                |                    |   |                                |                    |        |                                |                    |
//                                                                                                                              |                               |     |                                   |                               |     |                                   |                               |          |                                   |                               |
//               |                             /                 \                          |                                                                              |                               |     |                                   |                               |     |                                   |                               |          |                                   |                               |
//               
//       |                              Javascript to generate QrCode                   |                                           |               |                                           |               |                                           |                    |                                           |
//               
//                                 /             |    v    |             \
//               
//                       and barcode images from url for a github website project        |                                |                                          |      |                                |                                          |      |                                |                                          |           |                                |  
//     |                  !      |                                   |     |                                |                       |                    |                |                       |                    |                |                       |                    |                    |                                           |
//                               |                                   |     |                  
//                  |            |                   Anyway          !                        |                                         |                                |                       |                    |                |                       |                    |                |                       |                    |                    |
//               
//             |                      |                 have                                                 |                        |                                         |                                |                       |                    |                |                       |                    |                |                       |                    |                     |                                           |
//               //
//                |                                  FUN         |                        |                                         |                                |                       |                    |                |                       |                    |                |                       |                    |                    |                                                                      |
//               
//                                                        =)
//               
//
//                               |                      or                                       |                                                            |                    |                |                       |                    |                |                       |                    |                    |                                           |
//               //
//             |                              |       DIE ! ! !        |                       |                            |                |                       |                    |                |                       |                    |                    |                                           |#     |                        |                                         |                                |
//               
//
//                                                    !                                       |                                |                    |  |                                |                    |  |                                |                    |       |                                |                    |
//               
//     |               |                                 !
//               
//                 |                                                |            |                                   |                               |                           |                               |                           |                               |                                |                               |
//          |                                  !                                     |
//               
//                 |                     |                                                     |                                   |                               |     |                                   |                               |     |                                   |                               |          |                                   |                               |
//  |                          |                       |                    !
//          |                                    |                                         |     |                    |                                    | |     |                    |                                    | |     |                    |                                    |      |     |                    |                                    |
//     |                        |                                 |      |                                |                       |                    |                |                       |                    |                |                       |                    |                    |                                           |
//               
//                     |                                                |      |                                   |                               |                         |                               |                         |                               |                              |                               |
//          |                                   |                               |                   |                                |                       |                    |          |                                |                       |                    |          |                                |                       |                    |               |                                                                |
//               
//                 |                     |
//  |                                |                       |                    |            |                                |                       |                    |     |                                |                       |                    |                                    |                       |                              |                                                                        |
//          |                               |                                         !                              |                       |                    |                           |                       |                    |                           |                       |                    |                                |                       |                    |
//

//___  ____ _ _ _ ____ ____    ___  _    ____ _  _ ___
//|__] |  | | | | |___ |__/    |__] |    |__| |\ |  |
//|    |__| |_|_| |___ |  \    |    |___ |  | | \|  |

//OPENING | https://www.youtube.com/watch?v=_85LaeTCtV8 :3




//Link event listener to the "Generate" button
document.getElementById('generate-btn').addEventListener('click', generateImages);




//Function to generate codes images
function generateImages() {

    const url = document.getElementById('url-input').value;
    const generateQR = document.getElementById('qr-checkbox').checked;
    const generateBarcode = document.getElementById('barcode-checkbox').checked;
    const folderLabel = document.getElementById('folder-label');
    folderLabel.innerHTML = '';


    // We set style here because javascript is complete garbage (neither setAttribute or assign object does work 👩‍❤️‍👨 javascript 👨‍👩‍👧 )
    const imagesContainer = document.createElement('div');
    imagesContainer.style.display = 'flex';
    imagesContainer.style.flexDirection = 'column';
    imagesContainer.style.alignItems = 'center';
    imagesContainer.style.backgroundColor = '#ffffff'; 
    imagesContainer.style.borderRadius = '8px'; 
    imagesContainer.style.margin = '10px'; 
    imagesContainer.style.padding = '10px';




    if (!generateQR && !generateBarcode) {
        alert("Bruh !");
        return;
    }


    //Create a box to contain the qr code image and display it in 666x666px / black and white 
    if (generateQR) {
        const qrCodeDiv = document.createElement('div');
        new QRCode(qrCodeDiv, {
            text: url,
            width: 666,
            height: 666,
            colorDark: "#000000",
            colorLight: "#ffffff",
            correctLevel: QRCode.CorrectLevel.L
        });
        imagesContainer.appendChild(qrCodeDiv);
    }


    //Make container for txt label then add it to the imagesContainer
    const textContainer = document.createElement('div');
    textContainer.className = 'text-container';
    textContainer.innerHTML = '<p><br><br><br>⚔️ Bruh have to save the generated ⚔️<br><br><br></p>';
    imagesContainer.appendChild(textContainer);



    if (generateBarcode) {
        const barcode = document.createElement('img');
        JsBarcode(barcode, url, {
            format: "CODE128",
            lineColor: "#000",
            width: 2,
            height: 666,
            displayValue: false
        });
        imagesContainer.appendChild(barcode);
    }


    folderLabel.appendChild(imagesContainer);

    //Display the box after image are generated
    folderLabel.style.display = 'flex';
}
